In [69]:
# Creating dataset (No imports needed)
data = {
    "city": ["Mumbai", "Delhi", "Pune", "Mumbai", "Delhi"],
    "gender": ["Male", "Female", "Female", "Male", "Male"],
    "education": ["High School", "Graduate", "Post Graduate", "Graduate", "High School"],
    "salary": [50000, 42000, 60000, 52000, 45000]      # Target variable
}

import pandas as pd     # Only when needed
df = pd.DataFrame(data)
df

     city  gender      education  salary
0  Mumbai    Male    High School   50000
1   Delhi  Female       Graduate   42000
2    Pune  Female  Post Graduate   60000
3  Mumbai    Male       Graduate   52000
4   Delhi    Male    High School   45000

In [70]:
from sklearn.preprocessing import LabelEncoder 

le = LabelEncoder()

df['city']=le.fit_transform(df['city'])

df

   city  gender      education  salary
0     1    Male    High School   50000
1     0  Female       Graduate   42000
2     2  Female  Post Graduate   60000
3     1    Male       Graduate   52000
4     0    Male    High School   45000

In [71]:
from sklearn.preprocessing import OneHotEncoder

ohe=OneHotEncoder(drop='first',sparse_output=False)

encode_gender=ohe.fit_transform(df[['gender']])

gender_df=pd.DataFrame(encode_gender,columns=ohe.get_feature_names_out(['gender']))

df= pd.concat([df,gender_df],axis=1)
df.drop("gender", axis=1, inplace=True)    
df

   city      education  salary  gender_Male
0     1    High School   50000          1.0
1     0       Graduate   42000          0.0
2     2  Post Graduate   60000          0.0
3     1       Graduate   52000          1.0
4     0    High School   45000          1.0

In [73]:

from sklearn.preprocessing import OrdinalEncoder

oe = OrdinalEncoder()  

df["education"] = oe.fit_transform(df[["education"]])

df

   city  education  salary  gender_Male
0     1        1.0   50000          1.0
1     0        0.0   42000          0.0
2     2        2.0   60000          0.0
3     1        0.0   52000          1.0
4     0        1.0   45000          1.0

In [79]:
from sklearn.preprocessing import StandardScaler

scaler=StandardScaler()

df["salary"]=scaler.fit_transform(df[['salary']])
df

   city  education    salary  gender_Male
0     1        1.0  0.032208          1.0
1     0        0.0 -1.256105          0.0
2     2        2.0  1.642599          0.0
3     1        0.0  0.354286          1.0
4     0        1.0 -0.772988          1.0

In [81]:
from sklearn.model_selection import train_test_split

x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2)

x_train,x_test,y_train,y_test

(   city  education  gender_Male
 3     1        0.0          1.0
 0     1        1.0          1.0
 1     0        0.0          0.0
 2     2        2.0          0.0,
    city  education  gender_Male
 4     0        1.0          1.0,
 3    52000
 0    50000
 1    42000
 2    60000
 Name: salary, dtype: int64,
 4    45000
 Name: salary, dtype: int64)